In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.25.2)
Requirement already satisfied: tzdata>=2022.1 in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: six>=1.5 in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [12]:
import pandas as pd

In [13]:
df=pd.DataFrame([10,20,'bhavya',30, 40])

In [6]:
df

        0
0      10
1      20
2  bhavya
3      30
4      40

In [7]:
df.shape

(5, 1)

In [14]:
emp = {
    'id' : [101,102,103,104,105,106,107,108,109,110],
    'name' : ['modi','aaryan','bhavya','keval','monitor','sahitya','aman','het','khushi','dhwani'],
    'salary' : [100,200,150,300,250,180,80,240,400,350],
    'dept' : ['prod','act','sales','prod','prod','act','sales','act','sales','prod']   
}

In [16]:
df= pd.DataFrame(emp)

In [17]:
df

    id     name  salary   dept
0  101     modi     100   prod
1  102   aaryan     200    act
2  103   bhavya     150  sales
3  104    keval     300   prod
4  105  monitor     250   prod
5  106  sahitya     180    act
6  107     aman      80  sales
7  108      het     240    act
8  109   khushi     400  sales
9  110   dhwani     350   prod

In [18]:
df.shape

(10, 4)

In [19]:
df['salary']

0    100
1    200
2    150
3    300
4    250
5    180
6     80
7    240
8    400
9    350
Name: salary, dtype: int64

In [20]:
df['salary'].max()

400

In [21]:
df['salary'].min()

80

In [22]:
df['salary'].sum()

2250

In [23]:
df.columns

Index(['id', 'name', 'salary', 'dept'], dtype='object')

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   name    10 non-null     object
 2   salary  10 non-null     int64
 3   dept    10 non-null     object
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
type(df['dept'])

pandas.core.series.Series

In [27]:
type(df[['dept', 'name', 'salary']])

pandas.core.frame.DataFrame

In [28]:
df['dept'].value_counts()

dept
prod     4
act      3
sales    3
Name: count, dtype: int64

In [29]:
df['dept'].unique()

array(['prod', 'act', 'sales'], dtype=object)

In [31]:
df['dept']

0     prod
1      act
2    sales
3     prod
4     prod
5      act
6    sales
7      act
8    sales
9     prod
Name: dept, dtype: object

In [32]:
df.head()

    id     name  salary   dept
0  101     modi     100   prod
1  102   aaryan     200    act
2  103   bhavya     150  sales
3  104    keval     300   prod
4  105  monitor     250   prod

In [33]:
df.tail()

    id     name  salary   dept
5  106  sahitya     180    act
6  107     aman      80  sales
7  108      het     240    act
8  109   khushi     400  sales
9  110   dhwani     350   prod

In [34]:
df.head(3)

    id    name  salary   dept
0  101    modi     100   prod
1  102  aaryan     200    act
2  103  bhavya     150  sales

In [35]:
df.tail(4)

    id    name  salary   dept
6  107    aman      80  sales
7  108     het     240    act
8  109  khushi     400  sales
9  110  dhwani     350   prod

In [37]:
filt = df['dept'] == 'prod'
filt

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9     True
Name: dept, dtype: bool

In [39]:
df[filt]

    id     name  salary  dept
0  101     modi     100  prod
3  104    keval     300  prod
4  105  monitor     250  prod
9  110   dhwani     350  prod

In [40]:
df[~filt]

    id     name  salary   dept
1  102   aaryan     200    act
2  103   bhavya     150  sales
5  106  sahitya     180    act
6  107     aman      80  sales
7  108      het     240    act
8  109   khushi     400  sales

In [42]:
p = df['salary'] >= 300
df[p]

    id    name  salary   dept
3  104   keval     300   prod
8  109  khushi     400  sales
9  110  dhwani     350   prod

In [43]:
df[~p]

    id     name  salary   dept
0  101     modi     100   prod
1  102   aaryan     200    act
2  103   bhavya     150  sales
4  105  monitor     250   prod
5  106  sahitya     180    act
6  107     aman      80  sales
7  108      het     240    act

In [45]:
#wac to enter dept and salary and list only those employees having given dept and salary grt given.
d = input("Enter Dept: ")
s = int(input("Enter salary:  "))

filt = (df['dept'] == d) & (df['salary']>=s)
df[filt]

Enter Dept:  prod
Enter salary:   100

    id     name  salary  dept
0  101     modi     100  prod
3  104    keval     300  prod
4  105  monitor     250  prod
9  110   dhwani     350  prod